## To view Databases

show databases;

+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| sakila             |
| sys                |
| world              |
+--------------------+

Note:
By default, it depends on the operating system and its case sensitivity. This means MySQL is case-insensitive in Windows and macOS, while it is case-sensitive in most Linux systems.

## To create DataBase

create database <database name>

Query OK, 1 row affected (0.00 sec)

## To view current Databases

SELECT DATABASE() FROM DUAL;

+------------+
| DATABASE() |
+------------+
| learning   |
+------------+

In [ ]:
create table Customers (
    CustomerID int,
    CustomerName varchar(50),
    ContactName varchar(50),
    Address varchar(50),
    City varchar(50),
    PostalCode varchar(50),
    Country varchar(50))

In [ ]:
insert into Customers (CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country) Values 
(1,'Alfreds Futterkiste','Maria Anders','Obere Str. 57','Berlin','12209','Germany');

In [ ]:
insert into Customers (CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country) Values 
(2,'Ana Trujillo Emparedados y helados','Ana Trujillo','Avda. de la Constitución 2222','México D.F.','05021','Mexico'),
(3,'Antonio Moreno Taquería','Antonio Moreno','Mataderos 2312','México D.F.','05023','Mexico'),
(4,'Around the Horn','Thomas Hardy','120 Hanover Sq.','London','WA1 1DP','UK'),
(5,'Berglunds snabbköp','Christina Berglund','Berguvsvägen 8','Luleå','S-958 22','Sweden');

Symbol	Description	                        Example
%	    Represents zero or more characters	bl% finds bl, black, blue, and blob
_	    Represents a single character	    h_t finds hot, hat, and hit

LIKE Operator	                         Description
WHERE CustomerName LIKE 'a%'	Finds any values that start with "a"
WHERE CustomerName LIKE '%a'	Finds any values that end with "a"
WHERE CustomerName LIKE '%or%'	Finds any values that have "or" in any position
WHERE CustomerName LIKE '_r%'	Finds any values that have "r" in the second position
WHERE CustomerName LIKE 'a_%'	Finds any values that start with "a" and are at least 2 characters in length
WHERE CustomerName LIKE 'a__%'	Finds any values that start with "a" and are at least 3 characters in length
WHERE ContactName LIKE 'a%o'	Finds any values that start with "a" and ends with "o"

Supported Types of Joins in MySQL
INNER JOIN: Returns records that have matching values in both tables
LEFT JOIN: Returns all records from the left table, and the matched records from the right table
RIGHT JOIN: Returns all records from the right table, and the matched records from the left table
CROSS JOIN: Returns all records from both tables
MySQL INNER JOIN  MySQL LEFT JOIN  MySQL RIGHT JOIN  MySQL CROSS JOIN

In [ ]:
UNION column count and data type must be same removes duplicates
UNION all same as UNION but retails duplicates

Melwin remember on delete cascade

ON DELETE CASCADE constraint is used in MySQL to delete the rows from the child table automatically, when the rows from the parent table are deleted. For example when a student registers in an online learning platform, then all the details of the student are recorded with their unique number/id.

https://www.geeksforgeeks.org/mysql-on-delete-cascade-constraint/

## Connect to MYsql data base

In [ ]:
import os
import pymysql
import pandas as pd

host = os.getenv('MYSQL_HOST')
port = os.getenv('MYSQL_PORT')
user = os.getenv('MYSQL_USER')
password = os.getenv('MYSQL_PASSWORD')
database = os.getenv('MYSQL_DATABASE')

conn = pymysql.connect(
    host=host,
    port=int(3306),
    user="root",
    passwd=password,
    db="learning",
    charset='utf8mb4')

df = pd.read_sql_query("SELECT * FROM YOUR_TABLE",conn)
df.tail(10)